Revit 2024 API
ExternalApplicationException Class
The exception that is thrown when an issue in the Add-Ins resulted in an unexpected error.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[SerializableAttribute]
public class ExternalApplicationException : ApplicationException
Visual Basic
<SerializableAttribute> _
Public Class ExternalApplicationException _
	Inherits ApplicationException
Visual C++
[SerializableAttribute]
public ref class ExternalApplicationException : public ApplicationException
Remarks
Please contact your external application provider with the information about what led to this exception.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.ExternalApplicationException
See Also
ExternalApplicationException Members
Autodesk.Revit.Exceptions Namespace